#include<stdio.h>
#include<stdlib.h>
#include"menu.h"

void main_menu()
{
	printf("\33[37m\t\t\t************************\n\33[0m");
	printf("\33[31m\t\t\t**1.管理员登录        **\n\33[0m");
	printf("\33[32m\t\t\t**2.教师登录          **\n\33[0m");
	printf("\33[33m\t\t\t**3.学生登录          **\n\33[0m");
	printf("\33[34m\t\t\t**4.退出              **\n\33[0m");
	printf("\33[37m\t\t\t************************\n\33[0m");
	return;
}

void admin_menu()
{
	printf("\33[37m\t\t\t*******************\33[0m\n");
	printf("\33[31m\t\t\t**1.教师信息录入 **\33[0m\n");
	printf("\33[32m\t\t\t**2.修改教师信息 **\33[5m\n");
	printf("\33[33m\t\t\t**3.查看教师信息 **\33[0m\n");
	printf("\33[34m\t\t\t**4.删除教师信息 **\33[0m\n");
	printf("\33[35m\t\t\t**5.注销         **\33[0m\n");
	printf("\33[37m\t\t\t*******************\33[0m\n");
}

void main_teacher_menu()
{
	printf("\33[37m\t\t\t********************\33[0m\n");
	printf("\33[31m\t\t\t**1.录入学生信息  **\33[0m\n");
	printf("\33[32m\t\t\t**2.查看学生信息  **\33[0m\n");	
	printf("\33[33m\t\t\t**3.修改学生信息  **\33[0m\n");
	printf("\33[34m\t\t\t**4.删除学生信息  **\33[0m\n");
	printf("\33[35m\t\t\t**5.查看排名      **\33[0m\n");
	printf("\33[36m\t\t\t**6.修改登录密码  **\33[0m\n");
	printf("\33[31m\t\t\t**7.查看留言      **\33[0m\n");
	printf("\33[32m\t\t\t**8.辞职          **\33[0m\n");
	printf("\33[33m\t\t\t**9.注销          **\33[0m\n");
	printf("\33[37m\t\t\t********************\33[0m\n");
}

void subject_teacher_menu()
{
	printf("\33[37m\t\t\t*********************************\33[0m\n");
	printf("\33[31m\t\t\t**1.查看学生(自己所带科目)信息**\33[0m\n");
	printf("\33[32m\t\t\t**2.修改学生(自己所带科目)信息**\33[0m\n");
	printf("\33[33m\t\t\t**3.查看排名(自己所带科目)    **\33[0m\n");
	printf("\33[34m\t\t\t**4.修改自己登录密码          **\33[0m\n");
	printf("\33[35m\t\t\t**5.查看留言                  **\33[0m\n");
	printf("\33[36m\t\t\t**6.辞职                      **\33[0m\n");
	printf("\33[31m\t\t\t**7.注销                      **\33[0m\n");
	printf("\33[37m\t\t\t********************************\33[0m\n");
}

void student_menu()
{
	printf("\33[37m\t\t\t*****************************\33[0m\n");
	printf("\33[31m\t\t\t**1.查看自己信息(总分排名) **\33[0m\n");
	printf("\33[32m\t\t\t**2.修改自己登录密码       **\33[0m\n");
	printf("\33[33m\t\t\t**3.给老师留言             **\33[0m\n");
	printf("\33[34m\t\t\t**4.注销                   **\33[0m\n");
	printf("\33[37m\t\t\t*****************************\33[0m\n");
}
